@extends('admin.dashboard.base')

@section('content')

    <div class="container-fluid">
        <div class="animated fadeIn">
            <div class="row">
                <div class="col-sm-12 col-md-12">
                    <div class="card">
                        <div class="card-header">
                            <i class="fa fa-align-justify"></i> User Liza</div>
                        <div class="card-body">
                            <h5><b>Заголовок</b>О мотивации</h5>
                            <h5><b>Текст:</b>Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми выделениями из половых органов. Циклические процессы, происходящие в организме женщины, осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус, гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к возможной беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35 дней. Отсчет менструального цикла начинается с первого дня кровотечения. Менструальный цикл делится на две фазы, между которыми происходит овуляция. - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из которого выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец, ребенка. Она начинается в самый первый день начала менструации (менструального кровотечения) и заканчивается когда происходит овуляция. Занимает примерно половину</h5>
                            <a href="#" class="btn btn-block btn-primary">Назад</a>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>

@endsection


@section('javascript')

@endsection
