<template>
<main class="main account-main">
    <header class="account-header question">
      <MenuOffice></MenuOffice>
    </header>
    <section id="account-head" class="question">
        <div class="account-container">
          <div class="account-head__row">
              <div class="account-search">
                <input type="text" class="account-search__input" placeholder="Поиск">
                <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M14.362 9.80581H13.517L13.2176 9.57249C14.2657 8.58737 14.8967 7.30843 14.8967 5.91716C14.8967 2.81489 11.7844 0.300232 7.94476 0.300232C4.10514 0.300232 0.992798 2.81489 0.992798 5.91716C0.992798 9.01944 4.10514 11.5341 7.94476 11.5341C9.66671 11.5341 11.2496 11.0243 12.4689 10.1774L12.7577 10.4194V11.102L18.1053 15.4141L19.6989 14.1265L14.362 9.80581ZM7.94476 9.80581C5.28163 9.80581 3.13186 8.06888 3.13186 5.91716C3.13186 3.76545 5.28163 2.02852 7.94476 2.02852C10.6079 2.02852 12.7577 3.76545 12.7577 5.91716C12.7577 8.06888 10.6079 9.80581 7.94476 9.80581Z"
                      fill="#BEBEBE" />
                </svg>
              </div>
              <div class="account-head__mob-row">
                <Notifications></Notifications>
                <a href="index.html" class="account-head__exit">
                    <svg class="account-head__mob-svg" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path fill-rule="evenodd" clip-rule="evenodd" d="M14.99 11.2413V8.74375H9.99375V6.24375H14.99V3.7475L19.9875 7.495L14.99 11.2425V11.2413ZM12.4925 14.9887H7.495V3.74625L2.5 1.24875H12.4937V4.99625H13.7437V1.24875C13.7437 0.56125 13.1812 0 12.4937 0H1.24875C0.917764 0.000660653 0.600523 0.132437 0.36648 0.36648C0.132437 0.600523 0.000660653 0.917764 0 1.24875L0 15.4637C0 15.9512 0.275 16.3762 0.6875 16.6012L7.495 19.9987V16.2387H12.4925C13.18 16.2387 13.7425 15.6762 13.7425 14.9887V9.99375H12.4925V14.9913V14.9887Z" fill="#FF144A"/>
                    </svg>
                    <span>Выход</span>
                </a>
              </div>
          </div>
        </div>
    </section>
   <section id="question">
      <div class="account-container">
         <div id="progress" class="question question__container">
            <div class="question-tab">
               <div class="question-tab__btns">
                  <button class="question-tab__btn" data-id="manual">
                     Инструкция пользователя
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <button class="question-tab__btn" data-id="help">
                     Помощь
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <button class="question-tab__btn active" data-id="about-workout">
                     О тренировках
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <button class="question-tab__btn" data-id="about-motivations">
                     О мотивации
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <button class="question-tab__btn" data-id="about-diet">
                     О питании
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <button class="question-tab__btn" data-id="about-body">
                     О теле
                     <svg width="14" height="24" viewBox="0 0 14 24" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                           d="M1.83798 0.75C1.62365 0.749928 1.41382 0.812479 1.23501 0.930153C1.05612 1.04787 0.91613 1.21563 0.833318 1.41261C0.750488 1.60963 0.728769 1.82665 0.771065 2.03605C0.813355 2.24543 0.917627 2.43723 1.0701 2.58739L10.6217 12.0001L1.07004 21.4129L1.07 21.4129C0.968854 21.5126 0.888432 21.6312 0.833507 21.762C0.778579 21.8927 0.750276 22.033 0.750309 22.1748C0.750342 22.3165 0.778715 22.4568 0.833704 22.5875C0.888691 22.7182 0.969167 22.8368 1.07036 22.9365C1.17155 23.0361 1.29147 23.115 1.42318 23.1687C1.55488 23.2224 1.69591 23.25 1.83824 23.25C1.98057 23.25 2.12159 23.2223 2.25327 23.1685C2.38494 23.1147 2.5048 23.0358 2.60593 22.9361C2.60594 22.9361 2.60596 22.9361 2.60597 22.9361L12.9302 12.7615L12.9303 12.7614C13.1346 12.5601 13.25 12.2862 13.25 11.9998C13.25 11.7135 13.1346 11.4396 12.9303 11.2382L12.9302 11.2382L2.60593 1.06351L2.60587 1.06345C2.50466 0.963781 2.38473 0.884928 2.253 0.831215C2.1213 0.777515 1.98029 0.74995 1.83798 0.75ZM1.83798 0.75C1.83802 0.75 1.83806 0.75 1.8381 0.75L1.83798 1L1.83787 0.75C1.83791 0.75 1.83795 0.75 1.83798 0.75Z"
                           fill="#FF3E13" stroke="#FF3E13" stroke-width="0.5" />
                     </svg>
                  </button>
                  <div class="question-tab__social-txt">
                     <b>
                        Остались вопросы?
                     </b>
                     <p>
                        Найдите ответ на свой вопрос в разделе <a href="#">помощь</a> или напишите в наш <a href="#">телеграм-чат</a>
                     </p>
                  </div>
               </div>
               <div class="question-tab__body">
                  <div class="question-tab__content" id="manual">
                     <h5 class="question-tab__title">
                        О мотивации
                     </h5>
                     <p class="question-tab__prg">
                        Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                        через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в
                        организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми
                        выделениями из половых органов. Циклические процессы, происходящие в организме женщины,
                        осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус,
                        гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к
                        возможной
                        беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35
                        дней.
                        Отсчет менструального цикла начинается с первого дня кровотечения.
                        Менструальный цикл делится на две фазы, между которыми происходит овуляция.
                        - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из
                        которого
                        выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец,
                        ребенка.
                        Она начинается в самый первый день начала менструации (менструального кровотечения) и
                        заканчивается когда происходит овуляция. Занимает примерно половину
                     </p>
                  </div>
                  <div class="question-tab__content" id="help">
                     <h5 class="question-tab__title">
                        О мотивации
                     </h5>
                     <p class="question-tab__prg">
                        Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                        через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в
                        организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми
                        выделениями из половых органов. Циклические процессы, происходящие в организме женщины,
                        осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус,
                        гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к
                        возможной
                        беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35
                        дней.
                        Отсчет менструального цикла начинается с первого дня кровотечения.
                        Менструальный цикл делится на две фазы, между которыми происходит овуляция.
                        - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из
                        которого
                        выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец,
                        ребенка.
                        Она начинается в самый первый день начала менструации (менструального кровотечения) и
                        заканчивается когда происходит овуляция. Занимает примерно половину
                     </p>
                  </div>
                  <div class="question-tab__content active" id="about-workout">
                     <div class="question-tab__txt">
                        <h5 class="question-tab__title">
                           Тренировки при менструации
                        </h5>
                        <p class="question-tab__prg">
                           Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                           через приблизительно равные промежутки времени...
                        </p>
                        <a href="#" class="question-tab__link-more">
                           Подробнее
                        </a>
                     </div>
                     <div class="question-tab__txt">
                        <h5 class="question-tab__title">
                           Тренировки при менструации
                        </h5>
                        <p class="question-tab__prg">
                           Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                           через приблизительно равные промежутки времени...
                        </p>
                        <a href="#" class="question-tab__link-more">
                           Подробнее
                        </a>
                     </div>
                     <div class="question-tab__txt">
                        <h5 class="question-tab__title">
                           Тренировки при менструации
                        </h5>
                        <p class="question-tab__prg">
                           Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                           через приблизительно равные промежутки времени...
                        </p>
                        <a href="#" class="question-tab__link-more">
                           Подробнее
                        </a>
                     </div>
                     <div class="question-tab__txt">
                        <h5 class="question-tab__title">
                           Тренировки при менструации
                        </h5>
                        <p class="question-tab__prg">
                           Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                           через приблизительно равные промежутки времени...
                        </p>
                        <a href="#" class="question-tab__link-more">
                           Подробнее
                        </a>
                     </div>
                  </div>
                  <div class="question-tab__content" id="about-motivations">
                     <h5 class="question-tab__title">
                        О мотивации
                     </h5>
                     <p class="question-tab__prg">
                        Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                        через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в
                        организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми
                        выделениями из половых органов. Циклические процессы, происходящие в организме женщины,
                        осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус,
                        гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к
                        возможной
                        беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35
                        дней.
                        Отсчет менструального цикла начинается с первого дня кровотечения.
                        Менструальный цикл делится на две фазы, между которыми происходит овуляция.
                        - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из
                        которого
                        выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец,
                        ребенка.
                        Она начинается в самый первый день начала менструации (менструального кровотечения) и
                        заканчивается когда происходит овуляция. Занимает примерно половину
                     </p>
                  </div>
                  <div class="question-tab__content" id="about-diet">
                     <h5 class="question-tab__title">
                        О питании
                     </h5>
                     <p class="question-tab__prg">
                        Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                        через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в
                        организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми
                        выделениями из половых органов. Циклические процессы, происходящие в организме женщины,
                        осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус,
                        гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к
                        возможной
                        беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35
                        дней.
                        Отсчет менструального цикла начинается с первого дня кровотечения.
                        Менструальный цикл делится на две фазы, между которыми происходит овуляция.
                        - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из
                        которого
                        выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец,
                        ребенка.
                        Она начинается в самый первый день начала менструации (менструального кровотечения) и
                        заканчивается когда происходит овуляция. Занимает примерно половину
                     </p>
                  </div>
                  <div class="question-tab__content" id="about-body">
                     <h5 class="question-tab__title">
                        О теле
                     </h5>
                     <p class="question-tab__prg">
                        Менструальный цикл — сложный биологический процесс, происходящий в половых органах женщины
                        через приблизительно равные промежутки времени. Характеризуется циклическими изменениями в
                        организме женщины, особенно выраженными в яичниках и в матке, завершается кровянистыми
                        выделениями из половых органов. Циклические процессы, происходящие в организме женщины,
                        осуществляются при участии центральной нервной системы (кора головного мозга, гипоталамус,
                        гипофиз). Биологическая цель менструального цикла — подготовка организма женщины к
                        возможной
                        беременности. Нормальная продолжительность менструального цикла составляет от 21 до 35
                        дней.
                        Отсчет менструального цикла начинается с первого дня кровотечения.
                        Менструальный цикл делится на две фазы, между которыми происходит овуляция.
                        - Первая фаза называется фолликулярной. Именно в этой фазе развивается фолликул, из
                        которого
                        выйдет яйцеклетка, которая потом может превратиться в развивающийся плод и, наконец,
                        ребенка.
                        Она начинается в самый первый день начала менструации (менструального кровотечения) и
                        заканчивается когда происходит овуляция. Занимает примерно половину
                     </p>
                  </div>
               </div>
            </div>
         </div>
      </div>
   </section>
</main>
</template>
<script>
import Notifications from "../components/Notifications.vue";
import MenuOffice from "../components/Menu.vue";

export default {
  components: {
    MenuOffice,
    Notifications
  },
};
</script>